{
  "name": "Woo Easy Life",
  "slug": "woo-easy-life",
  "version": "1.1.7",
  "author": "Muhibbullah",
  "homepage": "https://api.wpsalehub.com/get-metadata",
  "download_url": "https://api.wpsalehub.com/download-plugins",
  "requires": "wooCommerce",
  "tested": 6.2,
  "requires_php": 7.3,
  "sections": {
    "description": "=== Woo Easy Life ===\nContributors: muhibbullah, nasir\nTags: woocommerce, sms, otp validation, fraud prevention, abandoned cart, cache prevention, cors\nRequires at least: 5.0\nTested up to: 6.2\nStable tag: 1.1.7\nRequires PHP: 7.4\nLicense: GPLv2 or later\nLicense URI: https://www.gnu.org/licenses/gpl-2.0.html\n\nWoo Easy Life is an all-in-one WooCommerce plugin designed to enhance store management with automation, customer engagement, fraud prevention, and real-time data delivery.\n\n== Description ==\n\n**Woo Easy Life** simplifies WooCommerce operations with features such as bulk SMS notifications, abandoned cart recovery, fraud prevention, courier integrations, and advanced cache prevention for real-time data.\n\n### **Key Features**\n\n- **Bulk SMS & Status-Based Notifications**: Automate customer communication for orders, status updates, and promotions.\n- **On-Click Courier Entry**: Quickly assign courier details from the order dashboard.\n- **Voucher Printing**: Generate printable vouchers for orders.\n- **Fraud Prevention Tools**: Identify and block suspicious customers by phone or IP.\n- **OTP Validation at Checkout**: Secure transactions by verifying phone numbers.\n- **Custom Order Statuses & SMS Updates**: Define and notify customers about custom statuses.\n- **Dashboard Analytics**: View sales trends, abandoned carts, and courier balances in one place.\n- **Blacklist Management**: Block fraudulent customers from making future purchases.\n- **Advanced Order Management**: Enhanced order filtering, bulk operations, and status changes.\n- **Real-time Fraud Detection**: AI-powered customer risk analysis and delivery prediction.\n- **Multi-Courier Integration**: Seamless integration with Steadfast and other courier services.\n- **Customer Analytics**: Deep insights into customer behavior and order patterns.\n- **Abandoned Cart Recovery**: Track and recover abandoned carts with automated notifications.\n- **Custom Checkout Fields**: Automatic capture and display of custom billing/shipping fields from any checkout plugin.\n- **Flexible Field Management**: Save custom field values to courier, invoice, or customer notes with dropdown selection.\n- **Cache Prevention System**: Prevents API caching by 12+ major cache plugins including WP Rocket, LiteSpeed, Cloudflare, W3 Total Cache, FlyingPress, NitroPack, and more.\n- **CORS Support**: Full cross-origin resource sharing for seamless frontend/Vue.js integration.\n- **Organized Navigation**: Dashboard submenu structure with Dashboard, Orders, Missing Orders, and Black List sections.\n\n### **Recent Updates (v1.1.7)**\n- NEW: Dashboard submenu navigation (Dashboard, Orders, Missing Orders, Black List).\n- NEW: Comprehensive cache prevention - bypasses WP Rocket, LiteSpeed, Cloudflare, W3 Total Cache, WP Fastest Cache, WP Super Cache, FlyingPress, NitroPack, SiteGround Optimizer, Swift Performance, Breeze, and Redis Object Cache.\n- NEW: Full CORS support with proper headers for cross-origin API requests.\n- NEW: Unique timestamp headers (X-WEL-Timestamp) for each API response.\n- NEW: Custom checkout fields support - automatically captures billing and shipping custom fields from any plugin.\n- NEW: Smart custom field detection - separates custom fields from default WooCommerce fields.\n- NEW: Custom fields display in WordPress admin order details page with styled sections.\n- NEW: Interactive custom field tooltips in order management interface.\n- NEW: Dropdown menu to save custom field values to courier, invoice, or customer notes.\n- NEW: Helper functions get_billing_custom_fields() and get_shipping_custom_fields().\n- IMPROVED: API responses now include comprehensive no-cache headers (Cache-Control, Pragma, Expires, CF-Cache-Status, CDN-Cache-Control, Surrogate-Control).\n- IMPROVED: Permission system - Shop Managers can now access WooEasyLife features.\n- IMPROVED: Admin menu structure with organized submenus.\n- IMPROVED: Order API response now includes custom_fields array in billing and shipping addresses.\n- IMPROVED: Custom field values can be appended to existing notes or create new ones.\n- IMPROVED: Better handling of custom fields from CartFlows, WooCommerce Checkout Manager, and other plugins.\n- SECURITY: Enhanced CORS headers with origin validation.\n- SECURITY: Cache-busting to prevent sensitive data caching.\n- ENHANCEMENT: Real-time custom field data display with hover-over information icon.\n- ENHANCEMENT: User-friendly field labels (auto-formatted from field keys).\n- ENHANCEMENT: TypeScript support for custom field data structures.\n- ENHANCEMENT: Better compatibility with caching plugins and CDN services.\n- ENHANCEMENT: Improved Vue.js SPA integration.\n- FIX: Resolved API caching issues across all major cache plugins.\n- FIX: Fixed CORS policy errors for development environments.\n- FIX: Custom field data properly structured with key, label, and value.\n- FIX: Toast notifications for successful custom field saves.\n\n== Installation ==\n\n1. Upload the plugin to `/wp-content/plugins/`.\n2. Activate it from the 'Plugins' menu in WordPress.\n3. Configure settings via Woo Easy Life Dashboard.\n4. Set up your SMS provider and courier integrations.\n5. Configure fraud detection and security settings.\n\n== Frequently Asked Questions ==\n\n**Q: How do I enable OTP validation at checkout?**  \nA: Enable it in the plugin settings and configure your preferred SMS provider.\n\n**Q: Can I block customers by phone number or IP?**  \nA: Yes, use the blacklist feature to prevent fraudulent purchases. You can also block by device and email.\n\n**Q: Does it support multiple courier services?**  \nA: Yes, Woo Easy Life integrates with various courier partners including Steadfast.\n\n**Q: How does the fraud detection work?**  \nA: Our AI-powered system analyzes customer behavior, order patterns, and delivery history to predict fraud risk.\n\n**Q: Can I customize order statuses?**  \nA: Yes, create custom order statuses with automated SMS notifications.\n\n**Q: How does abandoned cart recovery work?**  \nA: The system automatically tracks abandoned carts and allows you to convert them to orders with product validation.\n\n**Q: Will the plugin work with caching plugins?**  \nA: Yes! Version 1.1.7 includes comprehensive cache prevention that ensures real-time data even with WP Rocket, LiteSpeed, Cloudflare, and 10+ other caching plugins active.\n\n**Q: Does it support headless WordPress or Vue.js frontends?**  \nA: Yes! Full CORS support enables seamless integration with modern JavaScript frameworks like Vue.js, React, and Next.js.\n\n== Changelog ==\n\n= 1.1.7 =\n* NEW: Dashboard submenu structure (Dashboard, Orders, Missing Orders, Black List) for better navigation.\n* NEW: Comprehensive cache prevention system - prevents caching by all major WordPress cache plugins.\n* NEW: Full CORS support for cross-origin API requests - enables seamless frontend integration.\n* NEW: Protected against 12+ caching plugins: WP Rocket, LiteSpeed Cache, Cloudflare, W3 Total Cache, WP Fastest Cache, WP Super Cache, FlyingPress, NitroPack, SiteGround Speed Optimizer, Swift Performance, Breeze, and Redis Object Cache.\n* IMPROVED: API responses now include comprehensive no-cache headers for real-time data.\n* IMPROVED: Enhanced permission management - Shop Managers can now access WooEasyLife features.\n* IMPROVED: Admin menu structure with organized submenus for better UX.\n* IMPROVED: API endpoints now bypass all CDN/proxy caching layers.\n* SECURITY: Added CORS headers with proper origin validation.\n* SECURITY: Implemented cache-busting headers to prevent sensitive data caching.\n* FIX: Resolved API response caching issues across all major cache plugins.\n* FIX: Fixed CORS policy errors for localhost and development environments.\n* ENHANCEMENT: Unique timestamp headers (X-WEL-Timestamp) for each API response.\n* ENHANCEMENT: Better compatibility with caching plugins and CDN services.\n* ENHANCEMENT: Improved Vue.js SPA integration with proper CORS handling.\n\n= 1.1.5 =\n* NEW: Manual COD (Cash on Delivery) amount override when creating or updating orders, with automatic order note and audit trail.\n* NEW: Order note and metadata tracking for all manual COD modifications, including original and modified totals, user, and timestamp.\n* NEW: Improved sequential label printing—ensures each order label prints only after the previous one completes.\n* NEW: API endpoint for updating order total/COD now adds system note and metadata for all changes.\n* NEW: Helper function to retrieve COD modification notes for any order.\n* IMPROVED: Internet connection detection now prevents duplicate notifications and cleans up event listeners on component unmount.\n* IMPROVED: TypeScript and code structure for order creation, printing, and courier integration.\n* IMPROVED: Error handling and user notifications for all order and printing operations.\n* FIX: Prevented duplicate event listeners and notifications on SPA hot reloads.\n* FIX: Ensured order total update API validates input and handles errors gracefully.\n* FIX: Label printing now waits for print dialog to close before proceeding to the next order.\n* FIX: Various minor bug fixes and performance improvements throughout the plugin.\n\n= 1.1.4 =\n* NEW: Abandoned cart tracking and recovery dashboard.\n* NEW: Product existence validation before creating orders from abandoned carts.\n* NEW: Admin bar menu with real-time order status counts.\n* NEW: Dropdown menu showing Call Not Received, Courier Entry, and New Orders counts.\n* NEW: Performance-optimized caching for order counts (2-minute cache).\n* NEW: Automatic cache clearing when orders are created or status changes.\n* IMPROVED: Order creation workflow with comprehensive product validation.\n* IMPROVED: Enhanced error messages for product availability issues.\n* IMPROVED: Partial order creation support (creates orders with available products only).\n* IMPROVED: Better TypeScript type definitions across all composables.\n* IMPROVED: User experience with detailed notifications for order operations.\n* FIX: 'Product not found' errors during abandoned cart order creation.\n* FIX: Invalid order status errors in abandoned order filtering.\n* FIX: Loading state conflicts in order status updates.\n* FIX: API response handling for different order creation response structures.\n* ENHANCEMENT: Better phone number validation for Bangladesh numbers.\n* ENHANCEMENT: Improved error logging and debugging for order operations.\n\n= 1.1.3 =\n* NEW: Modern Vue.js 3 frontend with TypeScript support.\n* NEW: Advanced fraud detection with AI-powered risk analysis.\n* NEW: Quick order status change buttons (Cancelled, Call not received).\n* NEW: Enhanced customer data validation and phone normalization.\n* NEW: Improved courier integration with bulk operations.\n* NEW: Better error handling and user experience.\n* IMPROVED: Order management interface with advanced filtering.\n* IMPROVED: Customer analytics and behavior tracking.\n* IMPROVED: Security features with device blocking.\n* FIX: Route resolution errors in navigation.\n* FIX: TypeScript compatibility issues.\n\n= 1.1.2 =\n* **New Feature: Device Fingerprint Blocking.** Added capability to block orders based on a near-unique browser/device ID (Fingerprint) for robust fraud prevention.\n* **New Feature: Order Total/COD Adjustment.** Added API to manually update the order total, facilitating COD amount changes directly from the order list.\n* **Fix: Payment Method Update.** Resolved issue where Payment Method Title was not updating correctly after API change.\n* **Fix: Shipping Instance/Method.** Fixed 'Shipping method instance not available' error by improving backend logic to correctly find method instance across all zones.\n* **Fix: Trash Functionality.** Implemented robust order trashing using standard WC/WP functions to handle HPOS and Legacy systems correctly.\n* **Enhancement: Order List Filter.** Added dual filtering for 'Marked as Done' and 'Needs Follow Up' statuses for better workflow management.\n\n= 1.1.0 =\n* Added bulk SMS management.\n* Introduced OTP validation at checkout.\n* Improved courier entry process.",
    "changelog": "= 1.1.7 =\n* NEW: Dashboard submenu structure (Dashboard, Orders, Missing Orders, Black List) for better navigation.\n* NEW: Comprehensive cache prevention system - prevents caching by all major WordPress cache plugins.\n* NEW: Full CORS support for cross-origin API requests - enables seamless frontend integration.\n* NEW: Protected against 12+ caching plugins: WP Rocket, LiteSpeed Cache, Cloudflare, W3 Total Cache, WP Fastest Cache, WP Super Cache, FlyingPress, NitroPack, SiteGround Speed Optimizer, Swift Performance, Breeze, and Redis Object Cache.\n* IMPROVED: API responses now include comprehensive no-cache headers for real-time data.\n* IMPROVED: Enhanced permission management - Shop Managers can now access WooEasyLife features.\n* IMPROVED: Admin menu structure with organized submenus for better UX.\n* IMPROVED: API endpoints now bypass all CDN/proxy caching layers.\n* SECURITY: Added CORS headers with proper origin validation.\n* SECURITY: Implemented cache-busting headers to prevent sensitive data caching.\n* FIX: Resolved API response caching issues across all major cache plugins.\n* FIX: Fixed CORS policy errors for localhost and development environments.\n* ENHANCEMENT: Unique timestamp headers (X-WEL-Timestamp) for each API response.\n* ENHANCEMENT: Better compatibility with caching plugins and CDN services.\n* ENHANCEMENT: Improved Vue.js SPA integration with proper CORS handling.\n\n= 1.1.6 =\n* NEW: Bulk courier data update API endpoint (`/courier-data/update-bulk`) for efficient mass updates.\n* NEW: Bulk order status change API endpoint (`/orders/change-status-bulk`) for faster status management.\n* IMPROVED: Order status and courier data updates are now handled in bulk, reducing API calls and improving performance.\n* IMPROVED: Dashboard and analytics APIs now use consistent status filtering and support custom statuses.\n* FIX: Fixed logic for handling orders without consignment IDs during courier sync.\n* FIX: Minor bug fixes and code optimizations throughout the plugin.\n\n= 1.1.5 =\n* NEW: Manual COD (Cash on Delivery) amount override when creating or updating orders, with automatic order note and audit trail.\n* NEW: Order note and metadata tracking for all manual COD modifications, including original and modified totals, user, and timestamp.\n* NEW: Improved sequential label printing—ensures each order label prints only after the previous one completes.\n* NEW: API endpoint for updating order total/COD now adds system note and metadata for all changes.\n* NEW: Helper function to retrieve COD modification notes for any order.\n* IMPROVED: Internet connection detection now prevents duplicate notifications and cleans up event listeners on component unmount.\n* IMPROVED: TypeScript and code structure for order creation, printing, and courier integration.\n* IMPROVED: Error handling and user notifications for all order and printing operations.\n* FIX: Prevented duplicate event listeners and notifications on SPA hot reloads.\n* FIX: Ensured order total update API validates input and handles errors gracefully.\n* FIX: Label printing now waits for print dialog to close before proceeding to the next order.\n* FIX: Various minor bug fixes and performance improvements throughout the plugin.\n\n= 1.1.4 =\n* NEW: Abandoned cart tracking and recovery dashboard.\n* NEW: Product existence validation before creating orders from abandoned carts.\n* NEW: Admin bar menu with real-time order status counts.\n* NEW: Dropdown menu showing Call Not Received, Courier Entry, and New Orders counts.\n* NEW: Performance-optimized caching for order counts (2-minute cache).\n* NEW: Automatic cache clearing when orders are created or status changes.\n* IMPROVED: Order creation workflow with comprehensive product validation.\n* IMPROVED: Enhanced error messages for product availability issues.\n* IMPROVED: Partial order creation support (creates orders with available products only).\n* IMPROVED: Better TypeScript type definitions across all composables.\n* IMPROVED: User experience with detailed notifications for order operations.\n* FIX: 'Product not found' errors during abandoned cart order creation.\n* FIX: Invalid order status errors in abandoned order filtering.\n* FIX: Loading state conflicts in order status updates.\n* FIX: API response handling for different order creation response structures.\n* ENHANCEMENT: Better phone number validation for Bangladesh numbers.\n* ENHANCEMENT: Improved error logging and debugging for order operations.\n\n= 1.1.3 =\n* NEW: Modern Vue.js 3 frontend with TypeScript support.\n* NEW: Advanced fraud detection with AI-powered risk analysis.\n* NEW: Quick order status change buttons (Cancelled, Call not received).\n* NEW: Enhanced customer data validation and phone normalization.\n* NEW: Improved courier integration with bulk operations.\n* NEW: Better error handling and user experience.\n* IMPROVED: Order management interface with advanced filtering.\n* IMPROVED: Customer analytics and behavior tracking.\n* IMPROVED: Security features with device blocking.\n* FIX: Route resolution errors in navigation.\n* FIX: TypeScript compatibility issues.\n\n= 1.1.2 =\n* **New Feature: Device Fingerprint Blocking.** Added capability to block orders based on a near-unique browser/device ID (Fingerprint) for robust fraud prevention.\n* **New Feature: Order Total/COD Adjustment.** Added API to manually update the order total, facilitating COD amount changes directly from the order list.\n* **Fix: Payment Method Update.** Resolved issue where Payment Method Title was not updating correctly after API change.\n* **Fix: Shipping Instance/Method.** Fixed 'Shipping method instance not available' error by improving backend logic to correctly find method instance across all zones.\n* **Fix: Trash Functionality.** Implemented robust order trashing using standard WC/WP functions to handle HPOS and Legacy systems correctly.\n* **Enhancement: Order List Filter.** Added dual filtering for 'Marked as Done' and 'Needs Follow Up' statuses for better workflow management.\n\n= 1.1.0 =\n* Added bulk SMS management.\n* Introduced OTP validation at checkout.\n* Improved courier entry process."
  },
  "icons": {
    "1x": "https://wpsalehub.com/wp-content/uploads/2025/01/Health-care-logo-3.webp",
    "2x": "https://wpsalehub.com/wp-content/uploads/2025/01/Health-care-logo-3.webp",
    "svg": null
  }
}